arzh_loadTest/put_single.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 2.265ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.302ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.60ms  487.32us   6.17ms   67.23%
    Req/Sec   104.66    108.89   333.00     81.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.59ms
 75.000%    1.94ms
 90.000%    2.22ms
 99.000%    2.77ms
 99.900%    3.29ms
 99.990%    6.17ms
 99.999%    6.17ms
100.000%    6.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.491     0.000000            1         1.00
       0.955     0.100000          390         1.11
       1.171     0.200000          781         1.25
       1.328     0.300000         1177         1.43
       1.466     0.400000         1560         1.67
       1.592     0.500000         1952         2.00
       1.656     0.550000         2149         2.22
       1.716     0.600000         2341         2.50
       1.780     0.650000         2537         2.86
       1.857     0.700000         2732         3.33
       1.939     0.750000         2927         4.00
       1.981     0.775000         3024         4.44
       2.016     0.800000         3123         5.00
       2.053     0.825000         3219         5.71
       2.105     0.850000         3319         6.67
       2.161     0.875000         3417         8.00
       2.189     0.887500         3463         8.89
       2.217     0.900000         3510        10.00
       2.261     0.912500         3561        11.43
       2.303     0.925000         3608        13.33
       2.343     0.937500         3659        16.00
       2.371     0.943750         3682        17.78
       2.399     0.950000         3708        20.00
       2.433     0.956250         3730        22.86
       2.479     0.962500         3754        26.67
       2.535     0.968750         3779        32.00
       2.581     0.971875         3791        35.56
       2.605     0.975000         3803        40.00
       2.645     0.978125         3815        45.71
       2.669     0.981250         3827        53.33
       2.691     0.984375         3840        64.00
       2.713     0.985938         3846        71.11
       2.735     0.987500         3852        80.00
       2.759     0.989062         3858        91.43
       2.785     0.990625         3864       106.67
       2.803     0.992188         3870       128.00
       2.821     0.992969         3873       142.22
       2.849     0.993750         3876       160.00
       2.887     0.994531         3879       182.86
       2.959     0.995313         3882       213.33
       2.991     0.996094         3885       256.00
       3.025     0.996484         3887       284.44
       3.065     0.996875         3888       320.00
       3.077     0.997266         3890       365.71
       3.093     0.997656         3891       426.67
       3.131     0.998047         3893       512.00
       3.145     0.998242         3894       568.89
       3.145     0.998437         3894       640.00
       3.157     0.998633         3895       731.43
       3.285     0.998828         3896       853.33
       3.395     0.999023         3897      1024.00
       3.395     0.999121         3897      1137.78
       3.395     0.999219         3897      1280.00
       3.731     0.999316         3898      1462.86
       3.731     0.999414         3898      1706.67
       4.029     0.999512         3899      2048.00
       4.029     0.999561         3899      2275.56
       4.029     0.999609         3899      2560.00
       4.029     0.999658         3899      2925.71
       4.029     0.999707         3899      3413.33
       6.171     0.999756         3900      4096.00
       6.171     1.000000         3900          inf
#[Mean    =        1.603, StdDeviation   =        0.487]
#[Max     =        6.168, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 468.91KB read
Requests/sec:    200.04
Transfer/sec:     15.63KB